---
type: AssetSetIterator
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 4
tags: [revit-api, class]
---

# AssetSetIterator

`Autodesk.Revit.DB.Visual.AssetSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AssetSetIterator | — | `public AssetSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |